# Coding and Programming

## Capítulo 7

> Edwin Roman, Rep. Dominicana (Clase Lúnes a Miércoles).

### Procesamiento de datos, estadísticas descriptivas y visualización de datos

- **Unidad 34.** Uso de módulos de Python
- **Unidad 35.** Serie de Pandas para el tratamiento de datos
- **Unidad 36.** Pandas DataFrame para procesamiento de datos
- **Unidad 37.** Ordenamiento de datos
- **Unidad 38.** Datos de series temporales

___

## Q 34-01

Convierta los siguientes datos del diccionario en un dataframe usando **Pandas**.

(Denomina el dataframe `df`)

`d = { 'col1':[1,2], 'col2':[3,4], 'col3':[5,6], 'col4':[7,8] }`

In [1]:
import pandas as pd

''' 
## Q 34-01
Convierta los siguientes datos del diccionario en un dataframe usando **Pandas**.
(Denomina el dataframe `df`)
`d = { 'col1':[1,2], 'col2':[3,4], 'col3':[5,6], 'col4':[7,8] }`
'''
d = { 'col1':[1,2], 'col2':[3,4], 'col3':[5,6], 'col4':[7,8] }

df = pd.DataFrame.from_dict(d)

print(df)

   col1  col2  col3  col4
0     1     3     5     7
1     2     4     6     8

___

## Q 35-01

En el marco de datos creado en la pregunta **Q 34-01**, cree un nuevo dataframe que consista solo en los datos de la columna con el nombre de columna `'col4'`.

(Denomina el dataframe `new_df`)

In [4]:
print("Shape of df dataframe: ", df.shape) #comment

new_df = df[['col4']]


print("Shape of the new frame: ", new_df.shape) #comment
new_df

Shape of df dataframe:  (2, 4)
Shape of the new frame:  (2, 1)

   col4
0     7
1     8

## Q 36-01

El índice del dataframe creado en la pregunta **Q 34-01** es `0` y `1`.

Escriba un comando para cambiar el nombre de estos índices a `primero` y `segundo`.

In [8]:
# Index Renaming
df.index= ["primero", "segundo"]
df

         col1  col2  col3  col4
primero     1     3     5     7
segundo     2     4     6     8

___

## Q 37-01

Escriba un comando para buscar datos faltantes en el dataframe `df` creado en la pregunta **Q 34-01** e imprima el resultado.

(Sin embargo, los datos que faltan deben devolverse como verdaderos).

In [22]:
df.iloc[1,0] = None # Modificar un valor para poder apreciar el ejemplo.

print(df)

df.isnull()

         col1  col2  col3  col4
primero   1.0     3     0     7
segundo   NaN     4     6     8

          col1   col2   col3   col4
primero  False  False  False  False
segundo   True  False  False  False

___

## Q 38-01

Escriba un comando para verificar el resumen de las estadísticas descriptivas (desviación estándar, valor mínimo, moda, etc.) del dataframe `df` creado en la pregunta **Q 34-01** e imprima el resultado.

In [23]:
df.describe()

       col1      col2      col3      col4
count   1.0  2.000000  2.000000  2.000000
mean    1.0  3.500000  3.000000  7.500000
std     NaN  0.707107  4.242641  0.707107
min     1.0  3.000000  0.000000  7.000000
25%     1.0  3.250000  1.500000  7.250000
50%     1.0  3.500000  3.000000  7.500000
75%     1.0  3.750000  4.500000  7.750000
max     1.0  4.000000  6.000000  8.000000

___

# Fin
> Edwin Roman, Rep. Dominicana (Clase Lúnes a Miércoles). Bendiciones!